name = input("Как се казваш?: ")
age = input("На колко си години?: ")

print("Аз съм " + name + " и съм на " + age + " години.")  # първи начин за печатане
print(f"Аз съм {name} и съм на {age} години.")  # втори начин за печатане (за предпочитане)

age1 = "18"  # string
age2 = 18  # int

# Snake case:
# animal_type
# boy_name

# Пример с input() и int():
age = int(input("На колко си години?: "))
print(age + 3)

# input() винаги преобразува отговорът ни в стринг.
# Ако искаме въведеният от нас отговор да бъде цяло число, използваме int(input())
# Ако искаме въведеният от нас отговор да бъде float число, използваме float(input())


# Условни конструкции (if = ако, elif, else = ако не са изпълнени предишните условия)
# 1. Ако навън е топло ще бъда с тениска. if ...
# 2. Ако навън е прохладно ще бъда с горнище. elif ...
# 3. Ако навън е студено ще бъда с яке. else ...


age = 20

if age < 13:
    print("Дете")
elif 13 <= age <= 18:
    print("Тийнейджър")
else:
    print("Възрастен")
